profiling/results/stage-2_wrk_get.log
Running 1m test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 2.192ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.095ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.98ms    1.54ms  31.71ms   91.17%
    Req/Sec   530.67    141.42     1.30k    78.27%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.67ms
 75.000%    2.15ms
 90.000%    3.23ms
 99.000%    8.75ms
 99.900%   15.85ms
 99.990%   26.13ms
 99.999%   31.73ms
100.000%   31.73ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.280     0.000000            1         0.00
       0.863     0.100000         5013 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       1.094     0.200000         9993         0.00
       1.298     0.300000        15007        -0.00
       1.490     0.400000        20007        -0.00
       1.675     0.500000        25007         0.00
       1.766     0.550000        27482 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       1.854     0.600000        29982         0.00
       1.945     0.650000        32509        -0.00
       2.042     0.700000        34996        -0.00
       2.153     0.750000        37477         0.00
       2.223     0.775000        38750 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       2.307     0.800000        39995         0.00
       2.413     0.825000        41234        -0.00
       2.569     0.850000        42472        -0.00
       2.837     0.875000        43728         0.00
       3.005     0.887500        44347 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
       3.233     0.900000        44969         0.00
       3.487     0.912500        45596        -0.00
       3.777     0.925000        46219        -0.00
       4.089     0.937500        46844         0.00
       4.271     0.943750        47155 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
       4.491     0.950000        47467         -nan
       4.783     0.956250        47780        -0.00
       5.179     0.962500        48091        -0.00
       5.723     0.968750        48404         0.00
       6.007     0.971875        48561 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
       6.339     0.975000        48716         -nan
       6.747     0.978125        48872        -0.00
       7.111     0.981250        49029        -0.00
       7.591     0.984375        49185         0.00
       7.899     0.985938        49263 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
       8.155     0.987500        49340         0.00
       8.503     0.989062        49419        -0.00
       8.943     0.990625        49496        -0.00
       9.367     0.992188        49574         0.00
       9.655     0.992969        49613 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
       9.935     0.993750        49653         0.00
      10.223     0.994531        49691        -0.00
      10.655     0.995313        49731        -0.00
      11.087     0.996094        49769         0.00
      11.295     0.996484        49789 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      11.519     0.996875        49809         -nan
      11.791     0.997266        49828        -0.00
      12.223     0.997656        49847        -0.00
      12.623     0.998047        49867         0.00
      13.095     0.998242        49877 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      13.479     0.998437        49886         -nan
      14.159     0.998633        49897        -0.00
      14.895     0.998828        49906        -0.00
      16.015     0.999023        49916         0.00
      16.543     0.999121        49921 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      16.863     0.999219        49925         0.00
      17.791     0.999316        49930        -0.00
      18.655     0.999414        49935        -0.00
      19.647     0.999512        49940         0.00
      20.479     0.999561        49943 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
      21.663     0.999609        49945         0.00
      21.727     0.999658        49947        -0.00
      22.527     0.999707        49950        -0.00
      22.879     0.999756        49952         0.00
      23.407     0.999780        49954 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
      24.063     0.999805        49955         -nan
      25.663     0.999829        49956        -0.00
      25.775     0.999854        49957        -0.00
      25.999     0.999878        49958         0.00
      26.127     0.999890        49959 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
      26.511     0.999902        49960         -nan
      26.511     0.999915        49960        -0.00
      27.375     0.999927        49961        -0.00
      27.375     0.999939        49961         0.00
      27.791     0.999945        49962 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
      27.791     0.999951        49962         0.00
      27.791     0.999957        49962        -0.00
      30.127     0.999963        49963        -0.00
      30.127     0.999969        49963         0.00
      30.127     0.999973        49963 1197515777994123122827113180149268934166040916797761874901295891084783746657345444054174008110143315617531302687800938125050062129397660703838339185309575766350416028682216846776156215216348189439851718800547092882496686463674426196563591168.00
      30.127     0.999976        49963         0.00
      30.127     0.999979        49963        -0.00
      31.727     0.999982        49964        -0.00
      31.727     1.000000        49964         0.00
#[Mean    =        1.984, StdDeviation   =        1.545]
#[Max     =       31.712, Total count    =        49964]
#[Buckets =           19, SubBuckets     =         2048]
----------------------------------------------------------
  59985 requests in 1.00m, 4.14MB read
Requests/sec:    999.79
Transfer/sec:     70.59KB